___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [9]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,2,np.nan],
                  'C':[1,2,3]}) # np.nan miss value

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  NaN  NaN  3

In [12]:
df.dropna(axis=0) # any row or col has nan will be droped

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.dropna(axis=1) # only drop col

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh=2) #  thresh = 2 , means total 2 nan value  will be drop

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
df.fillna(value='FILL VALUE') # each row and col

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [13]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df['A'].fillna(value=df['A'].mean(),inplace = True) #fill by mean

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3